"""All texts to display."""
from constants import TJ, RU

CHOOSE_LANG_TEXT = 'Забонро интихоб кунед / Выберите язык:'
COURSES_LIST_TEXT = {
    TJ: 'Курсхои мо:',
    RU: 'Наши курсы: ',
}
WELCOME_TEXT = {
    TJ: 'Хуш омадед ба Webacademy-а',
    RU: 'Добро пожаловать в Webacademy-ю',
}
CONTACTS_TEXT = {
    TJ: 'Адреси мо: Шахри Душанбе\nТелефон: +992 987551165',
    RU: 'Наш адрес: Город Душанбе\nТелефон: +992 987551165', }
ABOUT_ACADEMY_TEXT = {
    TJ: 'ijij',
    RU: ('Для нас главное твой результат!\n\n'
         'Предоставление эффективного и доступного IT-образования, '
         'в котором нуждается таджикский рынок, которое даст им реальную '
         'возможность получить работу мечты и развивать свой талант несмотря '
         'на жизненные обстоятельства.'),
}

COURSES = {
    'ios': {
        TJ: {'text': 'Биёед хонем курси ios',
             'button_text': 'Курси айос'},
        RU: {'text': 'Давайте обучаться курсу ios',
             'button_text': 'Курс айос'},
    },
    'android': {
        TJ: {'text': 'Андроид ба пеш',
             'button_text': 'Курс Андроид'},
        RU: {'text': 'Андроид вперёд',
             'button_text': 'Курс Андроид'},
    }
}
